/* Title for event birthday (with a name) */
"%@\\U2019s Birthday" = "%@’s Birthday";

/* Title for event birthday (without a name) */
"Birthday" = "Birthday";

/* default calendar name */
"DEFAULT_CALENDAR_NAME" = "Calendar";

/* default reminders calendar name */
"DEFAULT_TASK_CALENDAR_NAME" = "Reminders";
// Also this one, sadly.  See 9806767 and 9696624
"Reminders" = "Reminders";

/* Errors, returned as part of EKError object. Generally only for developers, but they might appear in UI.*/
"EVENT_NOT_MUTABLE_ERROR" = "The event cannot be edited.";

"NO_CALENDAR_ERROR" = "No calendar has been set.";

"NO_START_DATE_ERROR" = "No start date has been set.";

"NO_END_DATE_ERROR" = "No end date has been set.";

"DATES_INVERTED_ERROR" = "The start date must be before the end date.";

"UNEXPECTED_ERROR" = "An unexpected error occurred.";

"CALENDAR_READ_ONLY_ERROR" = "The calendar is read only.";

"DURATION_EXCEEDS_RECURRENCE_ERROR" = "The event is too long to repeat this often.";

"ALARM_EXCEEDS_RECURRENCE_ERROR" = "The event repeats before the alert occurs.";

"START_DATE_FUTURE_ERROR" = "The event is too far in the future.";

"OCCURRENCE_COLLISION_ERROR" = "Another instance of this event occurs on this date.";

"INVITES_CANNOT_MOVE_ERROR" = "Invites cannot be moved to another calendar.";

"CANNOT_GEOCODE_LOCATION_ERROR" = "The reminder's location could not be geocoded to an address for firing the alarm.";

/* meaningless to end users, but useful for coders. It means the event is being used with the wrong database (store). */
"WRONG_STORE_ERROR" = "That event does not belong to that event store.";

/* developer error */
"SPAN_ERROR" = "An invalid span was specified.";

"CALENDAR_HAS_NO_SOURCE" = "Calendar has no source";

"DOES_NOT_ALLOW_RECURRENCE_CHANGES" = "The repeat field cannot be changed.";

"DOES_NOT_ALLOW_ALARM_CHANGES" = "Alarms cannot be changed.";

"DOES_NOT_ALLOW_ATTENDEE_CHANGES" = "Attendees cannot be changed";

"CALENDAR_IMMUTABLE" = "That calendar cannot be changed or deleted.";

"STRUCTURED_LOCATIONS_NOT_SUPPORTED" = "Locations with geo information are not supported by this account.";

"ACTIONS_NOT_SUPPORTED" = "Actions are not supported by this account.";

"REMINDER_LOCATIONS_NOT_SUPPORTED" = "Locations for reminders are not supported by this account.";

"ALARM_PROXIMITY_NOT_SUPPORTED" = "Proximity-based alarms are not supported by this account.";

"INVALID_ENTITY_ERROR" = "That calendar does not support items of that type.";

"RECURRING_TASK_REQUIRES_DUE_DATE_ERROR" = "A repeating reminder must have a due date.";

"SOURCE_PROHIBITS_CALENDAR_ADD_DELETE" = "That account does not allow calendars to be added or removed.";

"SOURCE_DOES_NOT_ALLOW_REMINDERS" = "That account does not allow calendars that contain reminders.";

/* users shouldn't ever see that. That would be a bug. But developers might */
"START_DATE_REQUIRED" = "A start date is required.";